Hitajadhav1234/STM32_DUAL_COUNTER_SYSTEM/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define FEESCL_Pin GPIO_PIN_8
#define FEESCL_GPIO_Port GPIOB
#define FEESDA_Pin GPIO_PIN_9
#define FEESDA_GPIO_Port GPIOB
#define FEEWP_Pin GPIO_PIN_15
#define FEEWP_GPIO_Port GPIOC
#define SW2_Pin GPIO_PIN_2
#define SW2_GPIO_Port GPIOA
#define SW1_Pin GPIO_PIN_3
#define SW1_GPIO_Port GPIOA
#define uC3_Pin GPIO_PIN_4
#define uC3_GPIO_Port GPIOA
#define uC2_Pin GPIO_PIN_5
#define uC2_GPIO_Port GPIOA
#define uC1_Pin GPIO_PIN_6
#define uC1_GPIO_Port GPIOA
#define DATA_IN_Pin GPIO_PIN_0
#define DATA_IN_GPIO_Port GPIOB
#define OUTPUT_EN_Pin GPIO_PIN_11
#define OUTPUT_EN_GPIO_Port GPIOA
#define CLOCK_Pin GPIO_PIN_12
#define CLOCK_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
